book/assets/assessments/dataPandasAssessment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-14 Tue 05:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Practicing Pandas for Data Analysis</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Practicing Pandas for Data Analysis</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgda98d91">1. Task</a></li>
<li><a href="#org06563cc">2. Requirements</a></li>
<li><a href="#org0511f45">3. Comments</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgda98d91" class="outline-2">
<h2 id="orgda98d91"><span class="section-number-2">1.</span> Task</h2>
<div class="outline-text-2" id="text-1">
<p>
You will
</p>
<ol class="org-ol">
<li>Download a data set in python</li>
<li>Unzip the data set</li>
<li>Tell me the names of all the columns</li>
<li>Tell me the length of one of the rows</li>
<li>And tell me the mean<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> of one of the columns subset by rows<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.</li>
</ol>
</div>
</div>

<div id="outline-container-org06563cc" class="outline-2">
<h2 id="org06563cc"><span class="section-number-2">2.</span> Requirements</h2>
<div class="outline-text-2" id="text-2">
<p>
Your submission will be either an org<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup> file with code blocks that let me execute each of these steps by myself interactively one at a time. Or a python script that I can run from the command line and that will perform each of these functions displaying its output to <code>stdout</code>. Stdout is the linux name for printing to the screen in the terminal. For example, when you do <code>ls</code> to list the names of files in a directory you are directing to stdout. 
</p>
</div>
</div>

<div id="outline-container-org0511f45" class="outline-2">
<h2 id="org0511f45"><span class="section-number-2">3.</span> Comments</h2>
<div class="outline-text-2" id="text-3">
<p>
Don't start by writing this as a script. That will almost certainly be too hard. Begin by doing this interactively, perhaps at a python interpreter until you get the code for a particular step done corrrectly. Then copy that code to your file and and test that it still works; that something did not get messed up in the copying and pasting.
Once you have the data in your interpreter, don't just rush through. Take some time to play with various pandas commands or exercises such as examples you can find <a href="https://www.w3resource.com/python-exercises/pandas/index-data-series.php">here</a> to generally grow more familiar with the package.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Or some other simple statistic appropriate to the data, e.g. if your data was <i>categorical</i> you might give me the number of rows for each type of category.  
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
An example of this is that if you had columns for heights and genders you could output the average height of men, women, and other. 
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
To make some nicer formatting and help available when using python from within emacs checkout the <code>elpy</code> <a href="https://elpy.readthedocs.io/en/latest/introduction.html#installation">package</a>. 
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-02-14 Tue 05:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>